Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 133, 133, 3) 0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 133, 133, 3) 0                                            
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 133, 133, 3)  12          input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 66, 66, 64)   1792        batch_normalization[0][0]        
                                                                 batch_normalization[1][0]        
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 66, 66, 64)   0           conv2d[0][0]                     
                                                                 conv2d[1][0]                     
__________________________________________________________________________________________________
dropout (Dropout)               (None, 66, 66, 64)   0           re_lu[0][0]                      
                                                                 re_lu[1][0]                      
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 66, 66, 64)   256         dropout[0][0]                    
                                                                 dropout[1][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 32, 16)   9232        batch_normalization_1[0][0]      
                                                                 batch_normalization_1[1][0]      
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 32, 32, 16)   0           conv2d_1[0][0]                   
                                                                 conv2d_1[1][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32, 32, 16)   0           re_lu_1[0][0]                    
                                                                 re_lu_1[1][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 16)   64          dropout_1[0][0]                  
                                                                 dropout_1[1][0]                  
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 15, 15, 4)    580         batch_normalization_2[0][0]      
                                                                 batch_normalization_2[1][0]      
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 15, 15, 4)    0           conv2d_2[0][0]                   
                                                                 conv2d_2[1][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 15, 15, 4)    16          re_lu_2[0][0]                    
                                                                 re_lu_2[1][0]                    
__________________________________________________________________________________________________
add (Add)                       (None, 15, 15, 4)    0           batch_normalization_3[0][0]      
                                                                 batch_normalization_3[1][0]      
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 5, 5, 4)      0           add[0][0]                        
__________________________________________________________________________________________________
flatten (Flatten)               (None, 100)          0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, 16)           1616        flatten[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 16)           64          dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 16)           272         batch_normalization_4[0][0]      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 16)           64          dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 4)            68          batch_normalization_5[0][0]      
==================================================================================================
Total params: 14,036
Trainable params: 13,798
Non-trainable params: 238
__________________________________________________________________________________________________